In [31]:
import numpy as np
import pandas as pd

df = pd.read_csv('titanic3.csv')
print(df)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  211.3375       B5        S    2
1       male   0.9167      1      2  113781  151.5500  C22 C26        S   11
2     female   2.0000      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.0000      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0000      1      2  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   14.4542      NaN        C  NaN
1305  female      NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.5000      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.0000      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.0000      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]

In [2]:
print(df.dropna(axis=0, how="all"))

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  211.3375       B5        S    2
1       male   0.9167      1      2  113781  151.5500  C22 C26        S   11
2     female   2.0000      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.0000      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0000      1      2  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   14.4542      NaN        C  NaN
1305  female      NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.5000      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.0000      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.0000      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]

In [4]:
print(df.dropna(axis=0, how="any"))

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare, cabin, embarked, boat, body, home.dest]
Index: []

In [5]:
print(df.fillna(0))

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000      0      0   24160  211.3375       B5        S    2
1       male   0.9167      1      2  113781  151.5500  C22 C26        S   11
2     female   2.0000      1      2  113781  151.5500  C22 C26        S    0
3       male  30.0000      1      2  113781  151.5500  C22 C26        S    0
4     female  25.0000      1      2  113781  151.5500  C22 C26        S    0
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.5000      1      0    2665   14.4542        0        C    0
1305  female   0.0000      1      0    2665   14.4542        0        C    0
1306    male  26.5000      0      0    2656    7.2250        0        C    0
1307    male  27.0000      0      0    2670    7.2250        0        C    0
1308    male  29.0000      0      0  315082    7.8750        0        S    0

       body                        home.dest
0       0.0                     St Louis, MO
1       0.0  Montreal, PQ / Chesterville, ON
2       0.0  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       0.0  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                                0
1305    0.0                                0
1306  304.0                                0
1307    0.0                                0
1308    0.0                                0

[1309 rows x 14 columns]

In [6]:
print(df.fillna('Desconocido'))

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex          age  sibsp  parch  ticket     fare        cabin  \
0     female           29      0      0   24160  211.338           B5
1       male       0.9167      1      2  113781   151.55      C22 C26
2     female            2      1      2  113781   151.55      C22 C26
3       male           30      1      2  113781   151.55      C22 C26
4     female           25      1      2  113781   151.55      C22 C26
...      ...          ...    ...    ...     ...      ...          ...
1304  female         14.5      1      0    2665  14.4542  Desconocido
1305  female  Desconocido      1      0    2665  14.4542  Desconocido
1306    male         26.5      0      0    2656    7.225  Desconocido
1307    male           27      0      0    2670    7.225  Desconocido
1308    male           29      0      0  315082    7.875  Desconocido

     embarked         boat         body                        home.dest
0           S            2  Desconocido                     St Louis, MO
1           S           11  Desconocido  Montreal, PQ / Chesterville, ON
2           S  Desconocido  Desconocido  Montreal, PQ / Chesterville, ON
3           S  Desconocido          135  Montreal, PQ / Chesterville, ON
4           S  Desconocido  Desconocido  Montreal, PQ / Chesterville, ON
...       ...          ...          ...                              ...
1304        C  Desconocido          328                      Desconocido
1305        C  Desconocido  Desconocido                      Desconocido
1306        C  Desconocido          304                      Desconocido
1307        C  Desconocido  Desconocido                      Desconocido
1308        S  Desconocido  Desconocido                      Desconocido

[1309 rows x 14 columns]

In [12]:
print(df['body'].fillna(0))
print(df['home.dest'].fillna('desconocido'))
print(df['age'].fillna(df['age'].mean()))

0         0.0
1         0.0
2         0.0
3       135.0
4         0.0
        ...
1304    328.0
1305      0.0
1306    304.0
1307      0.0
1308      0.0
Name: body, Length: 1309, dtype: float64
0                          St Louis, MO
1       Montreal, PQ / Chesterville, ON
2       Montreal, PQ / Chesterville, ON
3       Montreal, PQ / Chesterville, ON
4       Montreal, PQ / Chesterville, ON
                     ...
1304                        desconocido
1305                        desconocido
1306                        desconocido
1307                        desconocido
1308                        desconocido
Name: home.dest, Length: 1309, dtype: object
0       29.000000
1        0.916700
2        2.000000
3       30.000000
4       25.000000
          ...
1304    14.500000
1305    29.881135
1306    26.500000
1307    27.000000
1308    29.000000
Name: age, Length: 1309, dtype: float64

In [13]:
print(df.sex)

0       female
1         male
2       female
3         male
4       female
         ...
1304    female
1305    female
1306      male
1307      male
1308      male
Name: sex, Length: 1309, dtype: object

In [14]:
dummy_sex = pd.get_dummies(df.sex, prefix='axis')
print(dummy_sex)

      axis_female  axis_male
0               1          0
1               0          1
2               1          0
3               0          1
4               1          0
...           ...        ...
1304            1          0
1305            1          0
1306            0          1
1307            0          1
1308            0          1

[1309 rows x 2 columns]

In [37]:
df_copy=df.copy()
df_copy = df_copy.drop(['sex'], axis=1)
df_copy = pd.concat([df_copy, dummy_sex], axis=1)
print(df_copy)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

          age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0     29.0000      0      0   24160  211.3375       B5        S    2    NaN
1      0.9167      1      2  113781  151.5500  C22 C26        S   11    NaN
2      2.0000      1      2  113781  151.5500  C22 C26        S  NaN    NaN
3     30.0000      1      2  113781  151.5500  C22 C26        S  NaN  135.0
4     25.0000      1      2  113781  151.5500  C22 C26        S  NaN    NaN
...       ...    ...    ...     ...       ...      ...      ...  ...    ...
1304  14.5000      1      0    2665   14.4542      NaN        C  NaN  328.0
1305      NaN      1      0    2665   14.4542      NaN        C  NaN    NaN
1306  26.5000      0      0    2656    7.2250      NaN        C  NaN  304.0
1307  27.0000      0      0    2670    7.2250      NaN        C  NaN    NaN
1308  29.0000      0      0  315082    7.8750      NaN        S  NaN    NaN

                            home.dest  axis_female  axis_male
0                        St Louis, MO            1          0
1     Montreal, PQ / Chesterville, ON            0          1
2     Montreal, PQ / Chesterville, ON            1          0
3     Montreal, PQ / Chesterville, ON            0          1
4     Montreal, PQ / Chesterville, ON            1          0
...                               ...          ...        ...
1304                              NaN            1          0
1305                              NaN            1          0
1306                              NaN            0          1
1307                              NaN            0          1
1308                              NaN            0          1

[1309 rows x 15 columns]

In [38]:
sex = df.groupby(['sex', 'pclass'])[['survived']].aggregate('mean').unstack()
print(sex)

        survived
pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

In [33]:
sex = df.pivot_table('survived', index='sex', columns='pclass')
print(sex)

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

In [36]:
sex = df.pivot_table(index='sex', columns='pclass', aggfunc={'survived': sum, 'fare':'mean'})
print(sex)

              fare                       survived
pclass           1          2          3        1   2    3
sex
female  109.412385  23.234827  15.324250      139  94  106
male     69.888385  19.904946  12.415462       61  25   75

In [ ]:
df1 = pd.DataFrame({
    'nombre1': ['María', 'Ana', 'Camila'],
    'nombre2': ['Camila', 'María', 'Ana'],
    'peso': [60, 65, 70]
})

df2 = pd.DataFrame({
    'nombre1': ['María', 'Ana', 'Camila'],
    'altura': [160, 165, 170]
})
df3 = pd.merge(df1, df2)
print(df3)